Repository: AhmedShoaibOmer/Passem-Flutter-Firebase-Firestore-GoogleDrive-
Catalog: lib/l10n/intl_*.arb
Languages: ar

# google_sign_in_button
source: Sign in with google
ar: تسجيل الدخول بحساب قوقل

# no_internet_failure_title
source: No Internet Connection
ar: لا يوجد أتصال إنترنت

# login_no_internet_failure
source: You need to be connected to the internet to login.
ar: يجب ان تكون متصلا بالانترنت لتتمكن من تسجيل الدخول.

# login_with_google_failure
source: A problem occurred while linking your Google account. Please Try again.
ar: حدثت مشكلة اثناء ربط حساب قوقل الخاص بك. جرب مرة اخري.

# no_internet_message
source: Please Check your internet settings.
ar: أفحص اعدادات الانترنت الخاصة بك

source: Operation Failed
ar: فشلت العملية

# new_user_setup_failure
source: A problem occurred while setting up your account. Please Try again.
ar: حدثت مشكلة اثناء أعداد حسابك. جرب مرة اخري.

# new_user_no_internet_failure
source: You need to be connected to the internet to setup your new account.
ar: يجب ان تكون متصلا بالأنترنت لتتمكن من اعداد حسابك.

# continue_text
source: Continue
ar: أستمرار

# pick_university_label
source: Which University do you study in?
ar: في اي جامعة تدرس؟

# pick_university_hint
source: Pick your University
ar: أختر جامعتك

# pick_college_label
source: Which College do you study in?
ar: في اي كلية تدرس؟

# pick_college_hint
source: Pick your College
ar: أختر كليتك

source: Welcome
ar: مرحبا

# search_hint_home_page
source: Find a course and everything related to it
ar: أبحث عن مقرر دراسي وكل ما يتعلق به

# app_name
source: Passem App
ar: Passem تطبيق

source: By
ar: بواسطة

source: Starred Materials
ar: المميزة بنجمة

source: Home
ar: الرئيسية

source: My Courses
ar: مقرراتي

source: Starred
ar: المميزة بنجمة

# offline
source: Downloads
ar: التنزيلات

source: Courses
ar: مقررات

source: Recently Added
ar: مضافة حديثا

source: Top Contributors
ar: أعلى المشاركين

source: General document
ar: مستند عام

source: Summary
ar: ملخص

source: Lecture notes
ar: ملخصات محاضرة

source: Exam papers
ar: أوراق إمتحان

source: Exercise
ar: تمرين

source: External resource
ar: مصدر خارجي

source: General
ar: عام

source: Summaries
ar: ملخصات

source: Lectures notes
ar: ملخصات محاضرات

source: Exams papers
ar: أوراق إمتحانات

source: Exercises
ar: تمارين

source: External resources
ar: مصادر خارجية

source: Add
ar: إضافة

source: File
ar: ملف

source: Any document related to this course
ar: اي ملف متعلق بهذا المقرر

source: External Link
ar: مصدر خارجي

# add_external_link_subtitle
source: A link for a website, article, or a video related to this course
ar: رابط لموقع, مقال او لفيديو شرح متعلق بهذا المقرر

# paste_link_here
source: Paste The link here
ar: الصق الرابط هنا

# type_short_title
source: Type a short title
ar: ادخل عنوانا قصيرا

# add_description
source: Add some description (optional)
ar: اضف وصفا (إختياري)

source: File Path
ar: مسار الملف

# category_of_file
source: Category of this file
ar: تصنيف هذا الملف

source: Pick file category
ar: إختر تصنيف الملف

source: Related course
ar: الكورس الذي يتعلق به هذا المحتوى

# pick_course_related_to_content
source: Pick the course this content related to
ar: إختر الكورس الذي يتعلق به هذا المحتوى

# no_courses_were_found
source: No courses were found matching your search
ar: لم يتم العثور على مقررات تطابق بحثك

# try_adding_course
source: Try adding the course yourself
ar: جرب إضافة المقرر بنفسك

# no_results_found
source: No results were found
ar: لم يتم العثور على نتائج

# course_name_hint
source: Type the course name
ar: ادخل إسم المقرر

source: Add course
ar: إضافة مقرر

source: Remove from my courses
ar: إزالة من مقرراتي

source: Add to my courses
ar: إضافة الى مقرراتي

# copied_to_clipboard
source: Link copied to clipboard
ar: تم نسخ الرابط الى الحافظة

# unsupported_operation
source: Your device doesn't support this operation
ar: جهازك لا يدعم هذه العملية

source: Something went wrong.
ar: حدث خطأ ما

source: Try Again
ar: جرب مرة اخرى

source: Added Successfully
ar: تمت الإضافة بنجاح

source: Logout
ar: تسجيل الخروج

source: Open with
ar: فتح بواسطة

# delete_forever
source: Permanently Delete from Database
ar: حذف بشكل نهائي من قاعدة البيانات

# delete_forever_content
source: This item well be permanently deleted from our database, this action is irreversible.
ar: سيتم حذف هذا العنصر تماما من قاعدة بياناتنا, هذا الإجراء لا رجعة فيه.

source: Are you sure?
ar: هل انت متأكد؟

# delete_from_device_content
source: The downloaded content of this item well be deleted from your local storage.
ar: سيتم حذف محتوى هذا العنصر من زاكرة جهازك.

# delete_from_device
source: Delete from this device
ar: حذف من هذا الجهاز

source: Navigate to full course
ar: إنتقال الى المقرر الكامل

source: Share
ar: مشاركة

source: No courses found
ar: لم يم العثور على مقررات

# how_to_add_courses
source: How to add your courses here
ar: كيف تضيف مقرراتك هنا:

# how_to_add_courses_1
source: 1- From the home page, search for the course you want.
ar: 1- من الصفحة الرئيسية, إبحث عن المقرر الذي ترغب به.

# how_to_add_courses_2
source: 2- If the course exists, click 'Add to my courses' button.
ar: 2- اذا كان المقرر موجودا, إضغط على زر "إضافةالى مقرراتي".

# didnt_download_files
source: You didn't download any files
ar: لم تقم بتنزيل اي ملف

# all_files_downloaded
source: All files you download well be available here
ar: كل الملفات التي تقوم بتنزيلها ستكون متاحة هنا.

# no_starred_items
source: You have no starred items yet
ar: ليس لديك اي عناصر مميزة بنجمة

# add_starred_items
source: Start adding important items here by clicking the 'Star' button on the item.
ar: قم بإضافة العناصر المهمة هنا بالضغط على زر النجمة على العنصر.

source: Contact us
ar: تواصل معنا

source: Invite a friend
ar: دعوة صديق

# intro
source: Study anytime,anywhere and ace your exams
ar: ادرس في اي وقت, اي مكان وانجح بإمتياز

# intro_2
source: The best documents and study materials shared by your colleagues, organized in one place.
ar: افضل المستندات والمواد الدراسية التي تمت مشاركها بواسطة زملائك, منظمة في مكان واحد

# adding_to_my_courses_failure
source: Failed to add course to your courses, try again.
ar: فشلت إضافة المقرر الى مقرراتك, حاول مرة اخرى.

# removing_from_my_courses_failure
source: Failed to remove course from your courses, try again.
ar: فشلت إزالة المقرر من مقرراتك, حاول مرة اخرى.

# adding_to_my_courses_success
source: Successfully added to your courses.
ar: تمت الإضافة الى مقررانك بنجاح.

# removing_from_my_courses_success
source: Successfully removed from your courses.
ar: تمت الإزالة من مقررانك بنجاح.

source: Yes
ar: موافق

source: Cancel
ar: إلغاء

# item_delete_failure
source: Failed to delete item.
ar: فشل حذف العنصر.

# item_delete_success
source: Successfully deleted item.
ar: تم حذف العنصر.

# download_failed
source: File download failed, try again later.
ar: فشل تنزيل الملف, حاول مرة اخرى لاحقا.

source: File not found
ar: لم يتم العثور على الملف

source: New version available!
ar: اصدار جديد متوفر!

source: Update
ar: تحديث

source: Not now
ar: ليس الأن

source: Shares Count
ar: عدد المشاركات
